---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.WallUtils
source: html/d63bbbe2-fa2e-b827-2aad-ee6e5dfba4c6.htm
---
# WallUtils Members

Allows the wall's end to join to other walls. If that end is near other walls it will become joined as a result.